package com.example.shayari;

import android.os.Bundle;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import java.util.ArrayList;

public class ShayariActivity extends AppCompatActivity {

    private RecyclerView recyclerView;
    private ArrayList<shayariData> list;
    private int cat;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_shayari);

        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        cat = getIntent().getIntExtra("cat", 1);


        list = new ArrayList<>();
        switch (cat) {
            case 1:
                initList();
                break;

            case 2:
                initList2();
                break;
            case 3:
                initList3();
                break;
            case 4:
                initList4();
                break;
            case 5:
                initList5();
                break;
            case 6:
                initList6();
                break;
            case 7:
                initList7();
                break;
            case 8:
                initList8();
                break;
        }


        recyclerView = findViewById(R.id.recycler);
        recyclerView.setHasFixedSize(true);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));

        recyclerView.setAdapter(new shayariAdapter(this, list));

    }

    private void initList() {
        list.add(new shayariData("कौन कहता है संवरने से बढ़ती है खूबसूरती,\n" +
                "दिल मैं चाहत हो तो चेहरे यू ही निखर आते है। ❤️️"));

        list.add(new shayariData("चॉकलेट में है मेरे दिल की बात,\n" +
                "इस चॉकलेट में है तेरा इकरार,\n" +
                "अब नहीं होता मुझसे और इंतजार,\n" +
                "तो ये लो चॉकलेट एंड, हैप्पी चॉकलेट डे स्वीटहार्ट। ❤️️"));
        list.add(new shayariData("आज चॉकलेट डे है चॉकलेट तो खिलाओ,\n" +
                "मीठी मीठी कोई बात तो सुनाओ,\n" +
                "कप से तड़प रहे है हम आपके प्यार में,\n" +
                "आज तो हमें अपने गले से लगाओ।❤️️"));
        list.add(new shayariData("जो तू चाहे वो तेरा वो,\n" +
                "रोशन रातें और खूबसूरत सवेरा हो,\n" +
                "जारी रहे हमारी दोस्ती का सील सिला,\n" +
                "कामयाब हर मंजिल पर दोस्त मेरा हो।❤️️"));
        list.add(new shayariData("तेरे सिवा कोई अच्छा नहीं लगता,\n" +
                "तू मेरी बचपन की फेवरेट चॉकलेट जैसी है,\n" +
                "तुम्हारे सिवा मैं किसी को चॉकलेट भी ना दूँ,\n" +
                "दिल तो बहुत दूर की बात है।❤️️"));
        list.add(new shayariData("मीठा इंतजार और इंतजार से भी मीठा यार,\n" +
                "मीठा यार और यार से भी मीठा प्यार,\n" +
                "मीठा प्यार और प्यार से भी मीठी अपनी यारी।❤️️"));
        list.add(new shayariData("कुछ मीठा हो जाये कुछ प्यार हो जाये,\n" +
                "मोहब्बत अपनी बेशुमार हो जाये,\n" +
                "दिन है चॉकलेट डे का,\n" +
                "तो चलो आज कुछ मीठा हो जाये।❤️️"));
        list.add(new shayariData("बातें मुलाकाते ये छोटी से भेंट है,\n" +
                "मिलन का बहाना ये चॉकलेट है,\n" +
                "हर पल मेरा बस तेरे लिए है,\n" +
                "जोड़ी तेरी मेरी देखो परफेक्ट है।❤️️"));
        list.add(new shayariData("हँसी नजर से आज कुछ बोल दे,\n" +
                "खामोश लबों से आज नया नाम ले,\n" +
                "चॉकलेट से मीठी जुबाँ है तेरी,\n" +
                "बाँहों में आ के कानों में रस घोल दे।❤️️"));
        list.add(new shayariData("पसंद का तेरे मैंने ख्याल रखा है,\n" +
                "चॉकलेट का डब्बा हाथों में संभाल रखा है,\n" +
                "मुस्कुरा भी दे इश्क का आगाज,\n" +
                "तेरे क़दमों में दिल सिने से निकाल रखा है।❤️️"));

        list.add(new shayariData("जीने के लिए नहीं चाहा है तुम्हें,\n" +
                "तुम्हें चाहने के लिए जीते अब हम।"));
        list.add(new shayariData("सब ने चाहा कि उसे हम ना मिलें,\n" +
                "हम ने चाहा उसे गम ना मिलें,\n" +
                "अगर ख़ुशी मिलती है उसे हम से जुदा होकर,\n" +
                "तो दुआ है ख़ुदा से कि उसे कभी हम ना मिलें।"));
        list.add(new shayariData("मौत ने आँखें मिलाई थी कई बार मुझसे\n" +
                "पर तेरा दीवाना किसी और पे मरता कैसे!!"));

        list.add(new shayariData("जिसको याद करने से होठों पे मुस्कराहट आ जाये…\n" +
                "ऐसा एक खूबसूरत ख़याल हो तुम…"));
        list.add(new shayariData("दर्द तो सभी को होता है,\n" +
                "बस हमदर्द नसीब वालों को मिलते हैं। ❤️️"));

        list.add(new shayariData("रब करे आपका प्यार ऐसे ही बना रहे मेरे लिए,\n" +
                "जिसमे मुझे लाइफ का हर वो टेस्ट मिला है,\n" +
                "जो अलग अलग चॉकलेट्स में होता है।❤️️"));
        list.add(new shayariData("चॉकलेट डे आया है तेरी याद लाया है,\n" +
                "आजाओ आज दिल ने तुझे फिर बुलाया है,\n" +
                "ए जान-ए-तमन्ना तुझे मनाने के लिए मैंने,\n" +
                "चॉकलेट डे का पूरा डब्बा मँगवाया हैं।❤️️"));
        list.add(new shayariData("पानी की बूंदे फूलों को भिगा रही हैं,\n" +
                "ठंडी लहरे एक ताज़गी जगा रही हैं,\n" +
                "हो जायें आप भी इनमें शामिल,\n" +
                "एक प्यारी सी सुबह चॉकलेट के साथ आपको जगा रही हैं।❤️️"));
        list.add(new shayariData("दोस्ती के वादों को यूँ ही निभाते रहेंगे,\n" +
                "हम हर वक़्त आपको यूँ ही सताते रहेंगे,\n" +
                "मर भी जायेंगे तो क्या ग़म है,\n" +
                "हम आंसू बन कर आपकी आँखों में आते रहेंगे।❤️️"));
        list.add(new shayariData("हर रिश्ते में विश्वास रहने दो,\n" +
                "जुबान पर हर वक़्त मिठास रहने दो,\n" +
                "यही तो अंदाज़ है जिंदगी जीने का,\n" +
                "न खुद रहो उदास न दूसरों को रहने दो।❤️️"));
        list.add(new shayariData("बिन पुकारे हमे साथ पाओगे,\n" +
                "करो वादा की दोस्ती आप भी निभाओगे,\n" +
                "मतलब ये नहीं की रोज याद करना,\n" +
                "बस याद रखना उस वक्त,\n" +
                "जब अकेले अकेले चॉकलेट खाओगे।❤️️"));
        list.add(new shayariData("सनम तेरा ये मीठा सा प्यार,\n" +
                "लाया है मेरे जीवन में बहार,\n" +
                "इस प्यार की मिठास है एक बार,\n" +
                "चॉकलेट डे पर करती हूँ प्यार का इजहार।❤️️"));
        list.add(new shayariData("दिल हमारा चॉकलेट की तरह नाजुक,\n" +
                "तुम उसमे ड्राई फ्रूट्स का तड़का,\n" +
                "लाइफ होगी फ्रूट एंड नट जैसी,\n" +
                "अगर मिल गर्लफ्रेंड तेरे जैसी।। ❤️️"));

        list.add(new shayariData("हर रिश्ते में विश्वास रहने दो,\n" +
                "जुबान पर हर वक़्त मिठास रहने दो,\n" +
                "यही तो अंदाज़ है जिंदगी जीने का,\n" +
                "न खुद रहो उदास न दूसरों को रहने दो।"));

        list.add(new shayariData("पानी की बूंदे फूलों को भिगा रही हैं,\n" +
                "ठंडी लहरे एक ताज़गी जगा रही हैं,\n" +
                "हो जायें आप भी इनमें शामिल,\n" +
                "एक प्यारी सी सुबह चॉकलेट के साथ आपको जगा रही हैं।"));

        list.add(new shayariData("चॉकलेट डे आया है तेरी याद लाया है,\n" +
                "आजाओ आज दिल ने तुझे फिर बुलाया है,\n" +
                "ए जान-ए-तमन्ना तुझे मनाने के लिए मैंने,\n" +
                "चॉकलेट डे का पूरा डब्बा मँगवाया हैं।"));
        list.add(new shayariData("रब करे आपका प्यार ऐसे ही बना रहे मेरे लिए,\n" +
                "जिसमे मुझे लाइफ का हर वो टेस्ट मिला है,\n" +
                "जो अलग अलग चॉकलेट्स में होता है।"));

        list.add(new shayariData("त्यौहार प्यार का आया है,\n" +
                "संग अपने खुशियाँ लाया है,\n" +
                "ना रहे कोई भी रंग फीका,\n" +
                "कर लेते है पहले कुछ मुँह मीठा।"));

        list.add(new shayariData("गुल ने गुलशन से गुलफाम भेजा है,\n" +
                "सितारों ने आसमान से सलाम भेजा है,\n" +
                "मुबारक हो आपको चॉकलेट डे का यह प्यारा त्यौहार,\n" +
                "हमने अडवांस में यह पैगाम भेजा हैं।"));

        list.add(new shayariData("जिंदगी के किताब में कुछ पन्ने खास होते है,\n" +
                "कुछ अपने और कुछ बेगाने होते है,\n" +
                "प्यार से सवर जाती है जिंदगी,\n" +
                "जब रिश्तों में चॉकलेट की तरह मिठास होती हैं।"));

        list.add(new shayariData("त्यौहार प्यार का आया है,\n" +
                "संग अपने खुशियाँ लाया है,\n" +
                "ना रहे कोई भी रंग फीका,\n" +
                "कर लेते है पहले कुछ मुँह मीठा।"));
    }

    private void initList2() {
        list.add(new shayariData("अब तो शाम-ओ-सहर मुझे रहता हैं बस खयाल तेरा\n" +
                "कुछ इस कदर दुआओ सा मिला हैं मुझे साथ तेरा,\n" +
                "की अब कोई शिकवा और शिकायत नही उस खुदा से\n" +
                "बस एक तुम्हे पाकर खुशियो से भर गया ये दामन मेरा\n" +
                "\n" +
                "हैप्पी वैलेंटाइन्स डे️️"));
        list.add(new shayariData("बहुत छोटी-सी जिंदगी है मेरी उसमे एक तुम हो और तुम ही हो।"));

        list.add(new shayariData("जब से तुमको देखा जानम ये दिल ❤️और दिमाग\uD83E\uDDE0 बस तेरा ही दीदार चाहता है।"));

        list.add(new shayariData("मौत ने आँखें मिलाई थी कई बार मुझसे\n" +
                "पर तेरा दीवाना किसी और पे मरता कैसे!!"));

        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));

        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));
        list.add(new shayariData("जिजब मैंने तुम्हे पहली बार देखा था तब ही समझ गया था मेरे घर कि रोटी पकने वाली तुम ही ही।"));


        list.add(new shayariData("दर्द तो सभी को होता है,\n" +
                "बस हमदर्द नसीब वालों को मिलते हैं। ❤️️"));

        list.add(new shayariData("तड़प रहे हैं हम तेरे एक अल्फाज के लिए\n" +
                "अपनी खामोशी तोड़ दे हमे जिंदा रखने के लिए"));
    }

    private void initList3() {
        list.add(new shayariData("मै अपनी मोहब्बत लफ्ज़ से बाया ना कर सकु ये मोहब्बत ही कुछ ऐसी है️️"));
        list.add(new shayariData("सातवें जन्म तक साथ जीना है चाहे हो किसी चीज़ मे जन्म मुझे तेरे साए मे जीना है।"));
        list.add(new shayariData("मुझे कोई और चाहती है तो क्या मुझे तो प्यार सिर्फ अपनी मोहब्बत से है।"));
        list.add(new shayariData("मौत ने आँखें मिलाई थी कई बार मुझसे\n" +
                "पर तेरा दीवाना किसी और पे मरता कैसे!!"));

        list.add(new shayariData("जिकैसे बताऊं की मेरे चेहरे कि मुस्कान और मेरे दिल का हार्ट बीट तुम ही हो।"));
        list.add(new shayariData("मेरे आंखों मे चाहे आशु भर जाए लेकिन तुम्हारे चेहरे पे मुस्कान जरूरी है।️️"));
        list.add(new shayariData("ये दिल जो कभी ना धड़ाका था तुम्हे देख के धड़कने लगा कैसे बताऊं मै तुम्हे मुझे अपने से ज्यादा तुमसे प्यार हो गया।"));

        list.add(new shayariData("दर्द तो सभी को होता है,\n" +
                "बस हमदर्द नसीब वालों को मिलते हैं। ❤️️"));
        list.add(new shayariData("देखा तुमको जब से है,\n" +
                "ये बात इस दिल में तब से है,\n" +
                "मिल जाये मुझको प्यार तेरा,\n" +
                "फिर माँगना कुछ ना रब से हैं।❤️️"));
        list.add(new shayariData("सिर्फ तुमसे ही प्यार करता हूँ मैं,\n" +
                "जान अपनी तुम पर निसार करता हूँ मैं,\n" +
                "तेरे बिना जी नहीं सकता एक पल इसलिए,\n" +
                "अपनी मोहब्बत का आज इजहार करता हूँ मैं।❤️️"));
        list.add(new shayariData("तेरी खुशियों को सजाना चाहता हूँ,\n" +
                "तुझे देखकर मुस्कुराना चाहता हूँ,\n" +
                "मेरी जिंदगी में क्या अहमियत हैं तेरी,\n" +
                "ये लफ्जों में नहीं पास आकर बताना चाहता हूँ।❤️️"));
        list.add(new shayariData("फिर न सिमटेगी मोहब्बत जो बिखर जायेगी,\n" +
                "जिंदगी जुल्फ नहीं जो फिर सवंर जायेगी,\n" +
                "थाम लो हाथ उसका जो प्यार करे तुमसे,\n" +
                "ये जिंदगी ठहरेगी नहीं जो गुजर जायेगी।❤️️"));
        list.add(new shayariData("गम में हँसने वाले को रूलाया नहीं जाता,\n" +
                "लहरों से पानी को हटाया नहीं जाता,\n" +
                "होने वाले हो जाते हैं खुद ही अपने,\n" +
                "किसी को कहकर अपना बनाया नहीं जाता।❤️️"));
        list.add(new shayariData("बहते अश्कों की जुबाँ नहीं होती,\n" +
                "कभी लफ्जों में मोहब्बत बयाँ नहीं होती,\n" +
                "मिले जो प्यार तो कदर करना,\n" +
                "क्योंकि किस्मत हर किसी पर मेहरबान नहीं होती।❤️️"));
        list.add(new shayariData("मुझे खामोश राहों में तेरा साथ चाहिए,\n" +
                "तनहा है मेरा हाथ तेरा हाथ चाहिए,\n" +
                "जूनून-ए-इश्क को तेरी ही सौगात चाहिए,\n" +
                "मुझे जीने के लिए तेरा ही प्यार चाहिए।❤️️"));
        list.add(new shayariData("दिल की आवाज को इजहार-ए-इश्क कहते हैं,\n" +
                "झुकी निगाहों को इकरार-ए-इश्क कहते हैं,\n" +
                "सिर्फ जुबाँ से कहना ही इजहार-ए-इश्क मोहब्बत नहीं होती,\n" +
                "ख़ामोशी से मुस्कुराने को भी इकरार-ए-इश्क कहते हैं।❤️️"));
        list.add(new shayariData("आँखों की गहराई को समझ नहीं सकते,\n" +
                "होठों से हम कुछ कह नहीं सकते,\n" +
                "कैसे बयाँ करे हम आपको ये दिल-ए-हाल,\n" +
                "की तुम ही हो जिसके बैगेर हम रह नहीं सकते।❤️️"));
        list.add(new shayariData("आँखों में रहा दिल में उतरकर नहीं देखा,\n" +
                "कश्ती के मुशाफिर समंदर नहीं देखा,\n" +
                "पत्थर कहता है मुझे मेरा चाहने वाला,\n" +
                "मैं मोम हूँ उसने मुझे छु कर नहीं देखा।❤️️"));
        list.add(new shayariData("बहुत चाहा उसको जिसे हम पा न सके,\n" +
                "ख्यालों में किसी और को ला न सके,\n" +
                "उसको देख के आँसू तो पोंछ लिए,\n" +
                "लेकिन किसी और को देख कर मुस्कुरा न सके।❤️️"));
        list.add(new shayariData("तोड़ दो न वो कसम जो खाई हैं,\n" +
                "कभी कभी याद कर लेने में क्या बुराई हैं,\n" +
                "याद आप को किये बिना रहा भी तो नहीं जाता,\n" +
                "दिल में जगह आपने ऐसी जो बनाई हैं।❤️️"));
        list.add(new shayariData("ये प्रॉमिस है हमारा,\n" +
                "ना छोड़ेंगे कभी साथ तुम्हारा,\n" +
                "जो गये तुम हमें भूल कर,\n" +
                "ले आयेंगें पकड़ कर हाथ तुम्हारा।❤️️"));
        list.add(new shayariData("तुझे पलकों पे बिठाने को जी चाहता है,\n" +
                "तेरी बाहों से लिपटने को जी चाहता है,\n" +
                "खूबसूरती की इन्तेहा है तू,\n" +
                "तुझे जिंदगी में बसाने को जी चाहता हैं।❤️️"));
        list.add(new shayariData("आग बहते हुए पानी में लगा सकता हूँ,\n" +
                "चाँद तारें भी तेरे वास्ते ला सकता हूँ,\n" +
                "मेरी छिपकली अगर बात ना मानी मेरी,\n" +
                "तुझे उठा के हनीमून पे भी ले जा सकता हूँ।❤️️"));
        list.add(new shayariData("दर्द तो सभी को होता है,\n" +
                "बस हमदर्द नसीब वालों को मिलते हैं। ❤️️"));
        list.add(new shayariData("मेरी पनाह में आ कर तो देखो,\n" +
                "हमसे दिल लगा कर तो देखो,\n" +
                "प्यार तुम्हारे लिए मेरे दिल में इतना,\n" +
                "दामन छोटे पड़ जाए तुम्हारे,\n" +
                "बस एक बार नजर से नजर मिला कर तो देखो।❤️️"));
        list.add(new shayariData("नहाना है तो नदी में आओ,\n" +
                "किनारों पर क्या रखा हैं,\n" +
                "प्यार करना है तो बाहों में आओ,\n" +
                "इशारों में क्या रखा हैं।❤️️"));
        list.add(new shayariData("जो है नसीब में वो कम नहीं निकलता हैं,\n" +
                "हमारे दिल से तेरा गम नहीं निकलता हैं,\n" +
                "कहा है आजा की अब मैं सुकून से मर तो सकू।❤️️"));
        list.add(new shayariData("जलाते है हम अपने दिल को दिए की तरह,\n" +
                "तेरी जिंदगी में खुशियों की रौशनी लाने के लिए,\n" +
                "सह जाते है हर चुबन को अपने पैरों तले,\n" +
                "तेरी राहों में फूल बिछाने के लिए।❤️️"));
        list.add(new shayariData("मेरी जानम तुझे सलाम,\n" +
                "बहुत दिनों बाद दिल को आया आराम,\n" +
                "था इंतजार मुश्किल सूनी थी दिल की महफिल,\n" +
                "तेरी Deed हो गयी नजरों से ईद हो गयी,\n" +
                "मेरी जानम तुझे सलाम।"));

        list.add(new shayariData("बनकर तेरा साया तेरा साथ निभाऊंगी,\n" +
                "तु जहाँ जायेगा मैं वहां वहां आउंगी,\n" +
                "साया तो छोड़ जाता है साथ अँधेरे में,\n" +
                "लेकिन मैं अँधेरे में भी तेरा उजाला बन जाउंगी।❤️️"));
        list.add(new shayariData("दिल करता है जिंदगी तुझे दे दूँ,\n" +
                "जिंदगी की सारी खुशियां तुझे दे दूँ,\n" +
                "दे दे तू मुझे भरोसा अगर अपने साथ का,\n" +
                "तो यकीं मान अपनी साँसे भी तुझे दे दूँ।❤️️"));
        list.add(new shayariData("रब से आपकी ख़ुशी मांगते हैं,\n" +
                "दुआओं में आपकी हँसी मांगते हैं,\n" +
                "सोचते है आपसे क्या माँगे,\n" +
                "चलो तुमसे उम्र भर की मोहब्बत मांगते हैं।❤️️"));
        list.add(new shayariData("दिल ये मेरा तुमसे प्यार करना चाहता हैं,\n" +
                "अपनी मोहब्बत का इजहार करना चाहता हैं,\n" +
                "देखा है जब से तुम्हें मेने ए मेरे सनम,\n" +
                "सिर्फ तुम्हारा ही दीदार करने को दिल चाहता हैं। ❤️️"));
        list.add(new shayariData("दर्द तो सभी को होता है,\n" +
                "बस हमदर्द नसीब वालों को मिलते हैं। ❤️️"));
        list.add(new shayariData("कसूर तो था ही इन निगाहों का,\n" +
                "जो चुपके से दीदार कर बैठी,\n" +
                "हमने तो खामोश रहने की ठानी थी,\n" +
                "पर बेवफा ये जुबान इजहार कर बैठी।❤️️"));
        list.add(new shayariData("दिल की किताब में नाम उनका था,\n" +
                "रात की नींद में वो ख्वाब उनका था,\n" +
                "है कितना प्यार हमसे जब ये हमने पूछ लिया,\n" +
                "मर जाएँगे बिन तेरे ये जवाब उनका था। ❤️️"));
        list.add(new shayariData("फूलों पर जैसे पड़ती बारिश की बौछार हैं,\n" +
                "चमकने को जैसे फूल भी तैयार हैं,\n" +
                "उसी तरह मेरा दिल भी बेकरार हैं,\n" +
                "तू ही बता मैं क्यों न कहू की तुझसे कितना प्यार हैं।❤️️"));
        list.add(new shayariData("मुझको इस जहाँ में सिर्फ तुमसे मोहब्बत हैं,\n" +
                "मेरा इम्तिहान ले ले या मेरा एतबार तू कर ले,\n" +
                "ये आँखें आज भी तुझसे इजहार करेंगी,\n" +
                "चाहे तू मुझ पर जितना सितम कर ले। ❤️️"));
        list.add(new shayariData("मैंने दुआओं में तुझे माँगा,\n" +
                "बड़ी वफा से तुझे माँगा,\n" +
                "खुदा के दरबार में जब भी गया,\n" +
                "खुद की ख़ुशी की हर वजह में तुझे माँगा।❤️️"));
        list.add(new shayariData("आज हर एक पल खूबसूरत हैं,\n" +
                "दिल में मेरे सिर्फ तेरी ही सूरत हैं,\n" +
                "कुछ भी कहे ये दुनिया गम नहीं,\n" +
                "दुनिया से ज्यादा मुझे तेरी जरूरत हैं।❤️️"));
        list.add(new shayariData("ए पलक तू बंद हो जा,\n" +
                "ख्वाबों में उसकी सूरत तो नजर आयेगी,\n" +
                "इंतजार तो सुबह दोबारा शुरू होगी,\n" +
                "कम से कम रात तो ख़ुशी से कट जायेगी।❤️️"));
        list.add(new shayariData("इकरार में शब्दों की एहमियत नही होती,\n" +
                "दिल के जज्बात की आवाज नहीं होती,\n" +
                "आँखें बयाँ कर देती है दिल की दास्तान,\n" +
                "मोहब्बत लफ्जों की मोहताज नहीं होती।❤️️"));
        list.add(new shayariData("लबों को रखना चाहते है खामोश,\n" +
                "पर दिल कहने को बेकरार हैं,\n" +
                "मोहब्बत है तुमसे,\n" +
                "हाँ मोहब्बत बेशुमार हैं।❤️️"));
        list.add(new shayariData("क्या पता उसकी जुबाँ से भी इजहार निकले,\n" +
                "क्या पता उनके दिल में भी प्यार निकले,\n" +
                "सच है उसके बिना जी नहीं सकते हम,\n" +
                "क्या पता उसके दिल से भी यही बात निकले।❤️️"));
        list.add(new shayariData("मैं तेरे दिल में रहूं या तेरी आँखों में रहूँ,\n" +
                "जिंदगी बनके सनम मैं तेरी साँसों में रहूँ,\n" +
                "अब तुझे सोचती रहती हूँ मैं करवट करवट,\n" +
                "मेरी ख्वाहीश है की हर पल बाँहों में रहूँ।❤️️"));
        list.add(new shayariData("तेरी चाहत का दिया दिल में जला रखा हैं,\n" +
                "मैंने ये राज हवाओं से छिपा रखा हैं,\n" +
                "तुमको मिलना है अगर मुझसे तो जी भर के मिलो,\n" +
                "चाँद लम्हों की मुलाकात में क्या रखा हैं।❤️️"));
        list.add(new shayariData("गम की घटा को आँखों का काजल बना लिया,\n" +
                "यादों को यु समेटा की आँचल बना लिया,\n" +
                "जीने का कोई और तरीका ना रहा तो,\n" +
                "खुद को तुम्हारे प्यार में पागल बना लिया।❤️️"));
        list.add(new shayariData("तुझको महफूज है रखा कभी खोने ना दिया,\n" +
                "मैं किसी और की हो जाऊ ये होने ना दिया,\n" +
                "किस तरह मैं तुझसे इजहार करूँ हाल-ए-दिल,\n" +
                "तेरी यादों ने मुझे चैन से सोने ना दिया।❤️️"));
        list.add(new shayariData("तेरे प्यार के सहारे मेरी उम्र बीत जाये,\n" +
                "तुझे इस कदर मैं चाहूँ जितना कोई ना चाहे,\n" +
                "तेरा नाम हर जुबान पर मेरे साथ साथ आये,\n" +
                "मुझे मौत भी जो आये तो तेरी बाजुओं में आये।❤️️"));
        list.add(new shayariData("प्यार छुपता नहीं आँखें छुपाने से,\n" +
                "दिल रुकता नहीं किसी के समझाने से,\n" +
                "हम उसे याद करते रहे जीने के बहाने से,\n" +
                "क्योंकि रूक जाती है धड़कन उसे भूल जाने से।❤️️"));

    }

    private void initList4() {
        list.add(new shayariData("चाहता तो सच्चे मन से हूं लेकिन ये ज़ुबान से लफ्ज़ बाहर ही नहीं निकलते।️️"));
        list.add(new shayariData("जीने के लिए नहीं चाहा है तुम्हें,\n" +
                "तुम्हें चाहने के लिए जीते अब हम।"));
        list.add(new shayariData("सब ने चाहा कि उसे हम ना मिलें,\n" +
                "हम ने चाहा उसे गम ना मिलें,\n" +
                "अगर ख़ुशी मिलती है उसे हम से जुदा होकर,\n" +
                "तो दुआ है ख़ुदा से कि उसे कभी हम ना मिलें।"));
        list.add(new shayariData("मौत ने आँखें मिलाई थी कई बार मुझसे\n" +
                "पर तेरा दीवाना किसी और पे मरता कैसे!!"));

        list.add(new shayariData("जिसको याद करने से होठों पे मुस्कराहट आ जाये…\n" +
                "ऐसा एक खूबसूरत ख़याल हो तुम…"));
        list.add(new shayariData("दर्द तो सभी को होता है,\n" +
                "बस हमदर्द नसीब वालों को मिलते हैं। ❤️️"));
        list.add(new shayariData("तड़प रहे हैं हम तेरे एक अल्फाज के लिए\n" +
                "अपनी खामोशी तोड़ दे हमे जिंदा रखने के लिए"));

        list.add(new shayariData("list.add(new shayariData(\"तड़प रहे हैं हम तेरे एक अल्फाज के लिए\\n\" +\n" +
                "\"अपनी खामोशी तोड़ दे हमे जिंदा रखने के लिए\"));"));
        list.add(new shayariData("टूटा हुआ फूल खुशबू दे जाता हैं,\n" +
                "बिता हुआ पल यादें दे जाता हैं,\n" +
                "हर शख्स का अपना अंदाज होता हैं,\n" +
                "कोई जिंदगी में प्यार तो,\n" +
                "कोई प्यार में ज़िन्दगी दे जाता हैं।"));
        list.add(new shayariData("जिसे पाया ना जा सके वो जनाब हो तूम,\n" +
                "मेरी जिंदगी का पहला ख्वाब हो तूम,\n" +
                "लोग चाहे कुछ भी कहे लेकिन,\n" +
                "मेरी जिंदगी का एक सुन्दर सा गुलाब हो तूम।"));
        list.add(new shayariData("तुम्हारी अदा का क्या जवाब दूँ,\n" +
                "क्या खूबसूरत सा उपहार दूँ,\n" +
                "कोई तुमसे प्यारा गुलाब होता तो लाते,\n" +
                "जो खुद गुलाब है उसको क्या गुलाब दूँ।"));
        list.add(new shayariData("प्यार के समंदर में सब डूबना चाहते हैं,\n" +
                "प्यार में कुछ खोते हैं तो कुछ पाते हैं,\n" +
                "प्यार तो एक गुलाब है जिसे सब तोडना चाहते हैं,\n" +
                "हम तो इस गुलाब को चूमना चाहते हैं।"));
        list.add(new shayariData("गुलाब की खूबसूरती भी फिकी सी लगती हैं,\n" +
                "जब तेरे चेहरे पर मुस्कान खिल उठती हैं,\n" +
                "यूँ ही मुस्कुराते रहना मेरे प्यार तू,\n" +
                "तेरी खुशियों से मेरी साँसे जी उठती हैं।"));
        list.add(new shayariData("रोज रोज रोज डे आये,\n" +
                "फिर तू मेरे लिए गुलाब लाये,\n" +
                "इसी बहाने से सही,\n" +
                "तू मुझसे मिलने तो आये।"));
        list.add(new shayariData("मेरे आंसुओं में तू ही छुपी रहती हैं,\n" +
                "रोज आंखों से तू ही तो बरसती हैं,\n" +
                "किसी गुलाब की बेटी है तू शायद,\n" +
                "इसलिए मुरझाकर भी महकती हैं।"));
        list.add(new shayariData("मेरी दीवानगी की कोई हद नहीं,\n" +
                "तेरी सूरत के सिवा मुझे कुछ याद नहीं,\n" +
                "मैं गुलाब हूँ तेरे गुलशन का,\n" +
                "तेरे सिवाएं मुझ पर किसी का हक़ नहीं।"));
        list.add(new shayariData("गुलाब लाये है तेरे दीदार के लिए,\n" +
                "पर वो भी मुरझा गया तेरे नूर के आगे,\n" +
                "तू ऐसा खूबसूरत हिरा हैं,\n" +
                "की कोहिनूर भी सोचे तुझे पाने के लिए।"));
        list.add(new shayariData("एक रोज उनके लिए,\n" +
                "जो मिलते नहीं रोज रोज,\n" +
                "मगर याद आते हैं हर रोज।"));
        list.add(new shayariData("चला जा रे मैसेज बन के गुलाब,\n" +
                "होगी सच्ची दोस्ती तो आएगा जवाब,\n" +
                "अगर ना आये तो मत होना उदास,\n" +
                "बस समझ लेना की मेरे लिए,\n" +
                "वक्त नहीं था उनके पास।"));
        list.add(new shayariData("आप मिलते नहीं रोज रोज,\n" +
                "आपकी याद आती हैं हर रोज,\n" +
                "हमने भेजा हैं रेड रोज,\n" +
                "जो आपको हमारी याद दिलाएगा हर रोज।\n" +
                "\"हैप्पी रोज डे\""));
        list.add(new shayariData("किसी फूल में उतनी ख़ुशबू नहीं,\n" +
                "जितना मुझमें तुम महकते हों,"));
        list.add(new shayariData("आपके होंठों पर सदा खिलते गुलाब रहे,\n" +
                "खुदा ना करे आप कभी उदास रहे,\n" +
                "हम आपके पास चाहे रहे ना रहे ,\n" +
                "आप जिन्हें चाहे वो सदा आपके पास रहे।"));
        list.add(new shayariData("लफ्जों की तरह तुझे किताबों में मिलेंगे\n" +
                "बन के महक तुझे गुलाबों में मिलेंगे,\n" +
                "खुद को कभी अकेला मत समझना,\n" +
                "हम तुझे तेरे दिल में या तेरे ख्यालों में मिलेंगे।"));
        list.add(new shayariData("यूँ तो प्यार जताने के लिए,\n" +
                "किसी गुलाब की जरूरत नहीं हैं मुझे,\n" +
                "क्योंकि हर पल दिल से बहुत चाहा हैं तुझे।"));
        list.add(new shayariData("सात फरवरी को साथ तेरा पाने को,\n" +
                "दिल से तेरे दिल मिलाने को,\n" +
                "आया हूँ लेकर गुलाब तेरे बालों में सजाने को,\n" +
                "आ जा गले से लगाले अपने इस दीवाने को।"));
        list.add(new shayariData("आज दिल चाहता है तुझे गुलाब से सजा दूं,\n" +
                "प्यार सारा तुझ पर लुटा दूँ,\n" +
                "आकर तेरी जुल्फों के सायें में,\n" +
                "सारी दुनिया को भुला दूँ।"));
        list.add(new shayariData("ये रोज डे रोज रोज आये,\n" +
                "तू भी मुझे मिलने फिर यु रोज आये,\n" +
                "लेकर गुलाब हाथों में मेरे नेनों से नेन मिलाये,\n" +
                "और ये तेरा दीवाना तेरी झील सी आँखों में डूब जाये।"));
        list.add(new shayariData("लोग मंजिल को मुश्किल समझते हैं,\n" +
                "हम मुश्किल को मंजिल समझते हैं,\n" +
                "बड़ा फर्क है लोगों में और हम में,\n" +
                "लोग जिंदगी को दोस्त,\n" +
                "और हम दोस्त को जिंदगी समझते हैं,\n" +
                "आदत अलग है हमारी दुनिया वालों से,\n" +
                "कम दोस्त रखते है मगर लाजवाब रखते हैं,\n" +
                "क्योंकि बेशक हमारी माला छोटी हैं,\n" +
                "पर फूल उसमें सारे गुलाब के रखते हैं।"));
        list.add(new shayariData("इस चमन से जुदा हुआ एक गुलाब हूँ मैं,\n" +
                "खुद अपनी ही तबाही का जवाब हूँ मैं,\n" +
                "यूँ नजरे न फेर मुझसे ऐ मेरे सनम,\n" +
                "तेरी चाहतों में ही बर्बाद हुआ हूँ मैं।"));
        list.add(new shayariData("तेरी आहट से ही मेरे चेहरे पर मुस्कान आ जाती हैं,\n" +
                "तेरे होने का एहसास मेरी साँसे बयां कर जाती हैं,\n" +
                "ये सुन्दर गुलाब तेरी ही यादों का हिस्सा हैं,\n" +
                "जिन्हें देख कर फिर से वो खुशियाँ जवां हो जाती हैं।"));
        list.add(new shayariData("मेरा हर ख्वाब आज हक़ीकत बन जाये,\n" +
                "जो हो बस तुम्हारे साथ ऐसी जिंदगी बन जाये,\n" +
                "हम लाये लाखों में एक गुलाब आपके लिए,\n" +
                "और ये गुलाब मुहब्बत की शुरूआत बन जाये।"));
        list.add(new shayariData("फूल खिलते रहे जिंदगी की राह में,\n" +
                "हँसी चमकती रहे आपकी निगाह में,\n" +
                "कदम कदम पर मिले ख़ुशी की बहार आपको,\n" +
                "दिल देता है यही दुआ बार बार आपको।"));
        list.add(new shayariData("हर फूल आपको नए अरमान दे,\n" +
                "हमारी ये दुआ है तहे-दिल से,\n" +
                "अगर आपका एक आँसू भी निकले,\n" +
                "तो खुदा आपको दुगनी ख़ुशी दें।"));

        list.add(new shayariData("हर फूल आपको नए अरमान दे,\n" +
                "हमारी ये दुआ है तहे-दिल से,\n" +
                "अगर आपका एक आँसू भी निकले,\n" +
                "तो खुदा आपको दुगनी ख़ुशी दें।"));
        list.add(new shayariData("गुलाब तो टूट कर बिखर जाता है,\n" +
                "पर खुशबु हवा में बरकरार रहती हैं,\n" +
                "जाने वाले तो छोड़ कर चले जाते हैं,\n" +
                "पर एहसास तो दिलों में बरकरार रहते हैं।"));
        list.add(new shayariData("रिश्तों से बड़ी चाहत क्या होगी,\n" +
                "दोस्ती से बड़ी इबादत क्या होगी,\n" +
                "जिसे दोस्त मिल जाये आप जैसा,\n" +
                "उसे जिंदगी से शिकायत क्या होगी।"));
        list.add(new shayariData("फिजाओं का मौसम जाने के बाद बहारों का मौसम आया,\n" +
                "गुलाब से गुलाब का रंग तेरे गालों पर आया,\n" +
                "तेरे नैनो ने काली घटा का जब काजल लगाया,\n" +
                "जवानी जो तुम पर आई तो नशा मेरी आँखों में आया।"));
        list.add(new shayariData("फूलों जैसी लवों पर हँसी हो,\n" +
                "जीवन में आपको कोई न बेबसी हो,\n" +
                "ले आये हम प्यारा सा गुलाब आपके लिए,\n" +
                "बस इस गुलाब जैसी प्यारी आपकी जिंदगी हो।"));
        list.add(new shayariData("फूल बनकर हम महकना जानते हैं,\n" +
                "मुस्कुरा के हम गम भूलाना जानते हैं,\n" +
                "लोग खुश होते है हमसे,\n" +
                "क्योंकि बिना मिले ही हम रिश्ते निभाना जानते हैं।"));
    }

    private void initList5() {

        list.add(new shayariData("आज बारिश में तेरे साथ नहाना है,\n" +
                "सपना मेरा ये कितना सुहाना है,\n" +
                "बारिश की बुँदे जो गिरे तेरे होठों पे,\n" +
                "उन्हें अपने होठों से उठाना हैं।"));
        list.add(new shayariData("हर रोज तुझे प्यार करूँ,\n" +
                "हर रोज तुझे याद करूँ,\n" +
                "हर रोज तुझे मिस करूँ,\n" +
                "और आज के दिन तुझे में किस करूँ।"));
        list.add(new shayariData("ना आप कुछ करना ना हम कुछ करेंगे,\n" +
                "आप भी चुप रहना हम भी चुप रहेंगे,\n" +
                "एक दूजे को हम अपनी बाहों में भरेंगे,\n" +
                "फिर एक प्यारी सी किस करेंगे।"));
        list.add(new shayariData("चुम लूँ तेरे होठों को दिल की ये ख्वाहिश है,\n" +
                "बात ये मेरी नहीं दिल की फरमाइश हैं।"));
        list.add(new shayariData("काश मेरे होठ तेरे होठों को छू जाये,\n" +
                "देखूं जहाँ बस तेरे ही चेहरा नजर आये,\n" +
                "हो जाये हमारा रिश्ता कुछ ऐसा,\n" +
                "होंठों के साथ हमारा दिल भी जुड़ जाये।"));
        list.add(new shayariData("तेरे होठों को चूमा तो एहसास हुआ,\n" +
                "की एक पानी ही जरूरी नहीं प्यास बुझाने के लिए।"));
        list.add(new shayariData("मुझे बाँहों में बिखर जाने दो,\n" +
                "अपनी मुश्कब्र साँसों से महक जाने दो,\n" +
                "दिल मचलता है और साँसे रूकती है,\n" +
                "अब अपने होठों को मुझे छू लेने दो।"));
        list.add(new shayariData("मेरे प्यार का अफसाना भी है,\n" +
                "इसमें प्यार का खजाना भी है,\n" +
                "इसलिए चाहते है आपसे एक किश मांगना,\n" +
                "और आज तो मांगने का बहाना भी है।"));
        list.add(new shayariData("हद से ज्यादा तेरे करीब आने को जी करता है,\n" +
                "तेरे होठों को होठों से छू जाने को जी करता है,\n" +
                "तुम हो मेरे बेताब दिल की धड़कन,\n" +
                "तुम्हें अपना बनाने को जी करता है।"));
        list.add(new shayariData("मोहब्बत के रंग में डूबी शाम हो,\n" +
                "एक नई शुरुआत का पैगाम हो,\n" +
                "मिले तेरे होठ मेरे होठों से ऐसे,\n" +
                "जैसे मेरे होठ तेरे और तेरे होठ मेरे नाम हो।"));
        list.add(new shayariData("जब आती है याद तुम्हारी,\n" +
                "तो करके आँखें बंद,\n" +
                "तुम्हे मिस कर लेते है,\n" +
                "मुलाकात रोज हो नहीं पाती इसलिए,\n" +
                "ख्यालों में ही तुम्हे किस कर लेते है।"));
        list.add(new shayariData("ना जाने कब वो हसीन रात होगी,\n" +
                "जब उनकी निगाहें हमारी निगाहों के साथ होंगी,\n" +
                "बैठे है हम उस रात के इंतजार में,\n" +
                "जब उनके होठों की सुर्खियां हमारे होठों के साथ होगी।"));
        list.add(new shayariData("मेरे होठों से तेरे होंठों को गीला कर दूँ,\n" +
                "तेरे होठों को मैं और भी रसीला कर दूँ,\n" +
                "तू इस कदर प्यार कर और प्यार की इन्तहा हो जाये,\n" +
                "तेरे होठों को चूस कर तुझे और जोशीला कर दूँ।"));
        list.add(new shayariData("होठों से तुम्हें आज छु लू इस तरह,\n" +
                "और डूब के प्यार के नशे में तुमसे इजहार कर लूं,\n" +
                "सिमट जाओ आज की तेरी बाँहों में सनम,\n" +
                "और सारी हसरतें आज पूरी कर लूं।"));
        list.add(new shayariData("मैंने कहा तीखी मिर्ची हो तूम,\n" +
                "वो होंठ चूम कर बोली और अब?"));
        list.add(new shayariData("चलो संग मिलकर प्यार की गलियां धूम लेते है,\n" +
                "प्यार का इजहार तो कर लिया,\n" +
                "अब एक दुसरे को चूम लेते हैं।"));
        list.add(new shayariData("तुम हसीन हो गुलाब जैसी हो,\n" +
                "बहुत नाजुक हो ख्वाब जैसी हो,\n" +
                "होंठों से लगाकर पी जाऊं तुम्हें,\n" +
                "सर से पाँव तक शराब जैसी हो।"));
        list.add(new shayariData("एक किस के तलब-गार है हम\n" +
                "और मांगे तो गुनह-गार है हम।"));
        list.add(new shayariData("उनके होठों को देखा जब एक बात उठी जहन में,\n" +
                "वो लफ्ज कितने नशीले होंगे जो इनसे होकर गुजरते हैं।"));
        list.add(new shayariData("कभी दूर ना जाना तुम,\n" +
                "मैं तुम्हें बहुत मिस करूँगा,\n" +
                "अगर तुम दूर गई तो,\n" +
                "तेरी यादों को ही किस करूँगा।"));
        list.add(new shayariData("होंठों के तेरे होंठों से लगाना चाहते है,\n" +
                "बाँहों में अपनी छुपाना चाहते हैं,\n" +
                "हद-ए-मोहब्बत पार कर के,\n" +
                "आज तुझे अपना बनाना चाहते हैं।"));
        list.add(new shayariData("सुना है तुम ले लेती हो हर बात का सपना,\n" +
                "आजमाएंगे कभी तुम्हारे होंठों को चूम कर।"));
        list.add(new shayariData("मैं उनका गुरुर भी कुछ ऐसे तोड़ दिया,\n" +
                "आँखों को चूमा और होंठों को छोड़ दिया।"));
        list.add(new shayariData("बात बताने का बहाना कर के,\n" +
                "मैंने चूमा था उसके गालों को,\n" +
                "अब वो रोज जिद करती है,\n" +
                "की मुझे वो बात बताओ।"));
        list.add(new shayariData("किस की कोई भाषा नहीं होती,\n" +
                "किस की कोई जात नहीं होती,\n" +
                "आज कर लो मुझे किस,\n" +
                "क्योंकि कर रहा हूँ मैं तुझे बहुत मिस।"));
        list.add(new shayariData("शरबती होंठों से मैं ये जाम पीना चाहता हूँ,\n" +
                "बस दो पल तेरी बाँहों में ख़ुशी से जीना चाहता हूँ,\n" +
                "अपना बना ले मुझे की तेरा आशिक हूँ,\n" +
                "मैं तो बस तेरा हो के रहना चाहता हूँ।"));
        list.add(new shayariData("लबों से लबों की बात हो जाने दे,\n" +
                "तरस जो बरसों एक हो जाने दे,\n" +
                "सुर्खियाँ चुरा लूँ रंगत उड़ा दूँ,\n" +
                "आशिक को आज थोडा बदनाम होने दे।"));
        list.add(new shayariData("है मौसम प्यार का थोड़ा प्यार कर लो,\n" +
                "करते हो मोहब्बत अगर तो बाँहों में हमे भर लो,\n" +
                "चलो मेरे संग सपनो की दुनिया में घूम लो,\n" +
                "रोज़ हम चूमा करते हैं आज तुम हमें चूम लो।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("नैना थे कहां आपके इतने शराबी पहले\n" +
                "चेहरा था कहां आपका इतना किताबी पहले\n" +
                "आइना तो ज़रा देखिए लबों को चूमने के बाद\n" +
                "क्या होंठ थे आपके इतने गुलाबी पहले।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("किस किस की महफिल में\n" +
                "किस किस ने किस को किस किया\n" +
                "एक हम थे जिसने हर मिस को किस किया\n" +
                "और एक आप थे जिसने हर किस को मिस किया।\n" +
                "Happy kiss Day"));
        list.add(new shayariData("कभी तो सूरज ने चाँद को किस की होगी\n" +
                "तभी तो चाँद में दाग है\n" +
                "और चाँद ने वापस किस नहीं दी होगी\n" +
                "तभी तो सूरज में आग हैं।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("ना जाने कब वो हसीं रात होगी\n" +
                "जब उनकी निगाहे हमारी निगाहों के साथ होगी\n" +
                "बैठे है हम उस रात के इंतज़ार में\n" +
                "जब उनके होंठों की सुर्खिया हमारे होंठों के साथ होगी।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("मवो पहला किस जो हमने एक दूजे को किया\n" +
                "वो किस हमारे प्यार की शुरुआत थी\n" +
                "हमारा प्यार हमेशा कायम रहेगा\n" +
                "बस तुम उसी शिद्दत से मुझे किस करती रहना।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("मएक तमन्ना थी जो हसरत बन गई,\n" +
                "कभी दोस्ती थी अब मोहब्बत बन गई,\n" +
                "कुछ इस तरह शामिल हुए तुम जिंदगी में कि,\n" +
                "तुझे सोचते रहना मेरी आदत बन गई!\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("मछू लेने दो नाजुक होठों को\n" +
                "कुछ और नहीं हैं जाम हैं ये\n" +
                "कुदरत ने जो हमको बख्शा है\n" +
                "वो सबसे हंसीं ईनाम हैं ये।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("तुम्हारी यादों में दुनिया भुला दूँगा\n" +
                "दोगी जो भी सजा उसे दिल से लगा लूँगा\n" +
                "चाहत है आज एक किस की\n" +
                "एक बार हाँ कहो… तुम्हें दुनिया से चुरा लूँगा।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("हर रोज तुझे प्यार करूँ,\n" +
                "हर रोज तुझे याद करूँ,\n" +
                "हर रोज तुझे मिस करूँ,\n" +
                "और आज के दिन तुझे में किश करूँ।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("मकाश मेरे होंठ तेरे होंठों को छू जाए\n" +
                "देखूं जहा बस तेरा ही चेहरा नज़र आए\n" +
                "हो जाए हमारा रिश्ता कुछ ऐसा\n" +
                "होंठों के साथ हमारे दिल भी जुड़ जाए।\n" +
                "Happy Kiss Day"));
        list.add(new shayariData("मआज हर एक पल खूबसूरत हैं,\n" +
                "दिल में सिर्फ तेरी ही सूरत हैं,\n" +
                "तेरे होंठों को मेरे होंठों से छू जाने दे\n" +
                "दुनिया से ज्यादा मुझे तेरी जरूरत हैं।\n" +
                "हैप्पी किस डे जान"));
        list.add(new shayariData("मदिल अब बस तुझे ही चाहता है,\n" +
                "तेरी यादों में ये खो जाता है,\n" +
                "लग गयी है इस में इश्क की आग ऐसी,\n" +
                "के तेरे होंठो को चुमने को दिल चाहता है।\n" +
                "Happy Kiss Day"));
    }

    private void initList6() {

        list.add(new shayariData("तुझे देखा तो ये जाना सनम,\n" +
                "प्यार होता है दीवाना सनम,\n" +
                "अब यहाँ से कहा जाए हम,\n" +
                "तेरी बाँहों में मर जाए हम।"));
        list.add(new shayariData("एक ही तमन्ना,\n" +
                "एक ही आरजू,\n" +
                "बाँहों में पनाह में तेरे,\n" +
                "सारी जिंदगी गुजर जाये।"));
        list.add(new shayariData("जब भी तू अपनी बाहों में लेती है मुझे,\n" +
                "यह जमीं चाँद से बेहतर नजर आती है हमें।"));
        list.add(new shayariData("एक बार तो मुझे से सीने लगा ले,\n" +
                "अपने दिल के भी सारे अरमान सजा ले,\n" +
                "कब से है तड़प तुझे अपना बनाने की,\n" +
                "आज तो मौका है मुझे अपने पास बुला ले।"));
        list.add(new shayariData("मुझको फिर वही सुहाना नजारा मिल गया,\n" +
                "नज़रों को जो दीदार हरा मिल गया,\n" +
                "और किसी चीज की तमन्ना क्यों करूँ,\n" +
                "जब मुझे तेरी बाँहों में सहारा मिल गया।"));
        list.add(new shayariData("कोई कहे इसे जादू की झप्पी,\n" +
                "कोई कहे इसे प्यार,\n" +
                "मौका है खूबसूरत,\n" +
                "आ गले लग जा मेरे यार।"));
        list.add(new shayariData("हमको हमी से चुरा लो,\n" +
                "दिल में कही तुम छुपा लो,\n" +
                "हम अकेले हो ने जाये दूर तुमसे,\n" +
                "पास आओ गले से लगा लो।"));
        list.add(new shayariData("लाखों पल गुजारने हिया यूँ ही मुझको,\n" +
                "तेरी बाँहों में रह कर कभी मेरा दिल नहीं भरता।"));
        list.add(new shayariData("लग जा गले से ये रात फिर न आएगी,\n" +
                "किस्मत भी शायद हमको फिर न मिलाएगी,\n" +
                "बाकि है बस चाँद सांसे इस दिल में,\n" +
                "रूह भी न जाने कैसे तेरे बिन रह पाएगी।"));
        list.add(new shayariData("देखा है जबसे तुझको मेरा दिल नहीं है बस में,\n" +
                "जी चाहे आज तोड़ दूँ दुनिया की सारी रस्में,\n" +
                "तेरा साथ चाहता हूँ तेरा हाथ चाहता हूँ,\n" +
                "बाँहों में तेरी रहना मैं दिन रात चाहता हूँ।"));
        list.add(new shayariData("दिल की एक ही ख्वाहिश है,\n" +
                "धड़कनों की एक ही इच्छा है,\n" +
                "की तुम मुझे अपनी बाहों में पनाह दे दो,\n" +
                "और मैं इनमे खो जाऊँ।"));
        list.add(new shayariData("सिर्फ एक बार गले से लगाकर मेरे दिल की धड़कन सुन,\n" +
                "फिर लौटने का इरादा हम तुम पर छोड़ देंगे।"));
        list.add(new shayariData("मजबूती से बाहों में इस कदर थाम लूं तुझे,\n" +
                "की मेरे इश्क की कैद से तू चाहकर भी ना छूट सकें।"));
        list.add(new shayariData("बातों बातों में दिल ले जाते हो,\n" +
                "देखते हो इस तरह जान ले जाते हो,\n" +
                "अदाओं से अपनी इस दिल को धड़कते हो,\n" +
                "लेकर बाहों में सारा जहाँ भूलते हो।"));
        list.add(new shayariData("इतना ना तड़पाओ मेरे दिल को,\n" +
                "इतना ना सताओ मेरे बाहों को,\n" +
                "इतना ना छुपाओ तेरे प्यार को,\n" +
                "आग दोनों तरफ लगी है,\n" +
                "आप ले लो मुझे अपनी बाहों में।"));
        list.add(new shayariData("मुझसे दिल की मायूसी यूँ छुपाई नहीं जाती है,\n" +
                "गले लगाती हो तो दिल की धड़कने हँसने लगती हैं।"));
        list.add(new shayariData("मन ही मन करती हूँ बातें,\n" +
                "दिल की हर एक बात कह जाती हूँ,\n" +
                "एक बार ले लो बाहों में अब तो सजना,\n" +
                "यही एक बात कहते कहते रूक जाती हूँ,\n" +
                "“हैप्पी हग डे माय लव”"));
        list.add(new shayariData("दिल की बातें कितना छुपाओगी,\n" +
                "अब तो कह दो,\n" +
                "अगर इन बैचेन निगाहों में इश्क है,\n" +
                "तो गले लगा लो।"));
        list.add(new shayariData("लिपट जाओ फिर एक बार गले हमारे,\n" +
                "कोई दीवार ना रहे बीच हमारे तुम्हारे,\n" +
                "लिपट जाती जरूर अगर जमाने का डर ना होता,\n" +
                "बसा लेती मैं तुम्हें अगर सीने मैं घर होता।"));
        list.add(new shayariData("मैं तेरी ज़ुल्फ़ों और आँखो में खोया रहता हूँ,\n" +
                "बस इसी तरह ज़िंदगी को जीने चाहता हूँ।"));
        list.add(new shayariData("मुझे बाँहों में बिखर जाने दो,\n" +
                "अपनी मुस्कुराती साँसों से महक जाने दो,\n" +
                "दिल मचलता है और सांसे रूक जाती है,\n" +
                "अब तो सीने में आज मुझे उतर जाने दो,\n" +
                "हग डे पर एक हग तो दे दो।"));
        list.add(new shayariData("ये सर्द हवाएं कह रही है,\n" +
                "तुझे गले से लगा लूँ,\n" +
                "छुप जाऊं तेरी बाहों में,\n" +
                "और दुनिया को बुला दूँ।"));
        list.add(new shayariData("मुझे तेरी ही बाँहों में उम्रकैद की सजा चाहिए,\n" +
                "तुझसे मोहब्बत की है ये गुनाह है मेरा।"));
        list.add(new shayariData("नाराजगियां भी कबूल थी आपकी मगर,\n" +
                "एक बार गले से हमें लगाया तो होता। "));
        list.add(new shayariData("तुझे देखा तो ये जाना सनम,\n" +
                "प्यार होता है दीवाना सनम,\n" +
                "अब यहाँ से कहा जाए हम,\n" +
                "तेरी बाँहों में मर जाए हम।"));
        list.add(new shayariData("सिर्फ एक बार गले से लगाकर मेरे दिल की धड़कन सुन,\n" +
                "फिर लौटने का इरादा हम तुम पर छोड़ देंगे।\n" +
                "दिल में प्यार का आगाज हुआ करता है,\n" +
                "बातें करने का अंदाज हुआ करता है,\n" +
                "जब तक दिल को ठोकर नहीं लगती,\n" +
                "सबको अपने प्यार पर नाज हुआ करता है।"));
        list.add(new shayariData("बांहों मे चले आओ सनम,\n" +
                "हमसे सनम क्या पर्दा,\n" +
                "यह आज का नहीं मिलन,\n" +
                "यह संग है उम्र भर का।"));
        list.add(new shayariData("दिल की एक ही ख़्वाहिश हैं..\n" +
                "धड़कनों की एक ही इच्छा हैं..\n" +
                "के तुम मुझे अपनी बाहों में पनाह दे दो,\n" +
                "और में खो जाऊ।\n" +
                "Happy Hug Day"));
        list.add(new shayariData("नाराजगी कितनी भी हो तुमसे पर तुम्हें,\n" +
                "छोड़ने का खयाल आज तक नहीं आया।"));
        list.add(new shayariData("मोहब्बतों में दिखावे की दोस्ती न मिला,\n" +
                "अगर गले नहीं मिलता तो हाथ भी न मिला।"));
        list.add(new shayariData("मैं तेरी ज़ुल्फ़ों और आँखो में खोया रहता हूँ,\n" +
                "बस इसी तरह ज़िंदगी को जीने चाहता हूँ।"));
        list.add(new shayariData("एक ख्वाहिश पूरी हो इबादत के बगैर,\n" +
                "वो आ कर गले लगा ले, इजाज़त के बगैर।\n" +
                "\n" +
                "इत्तेफाक से जब वो चूम लेते है मेरे माथे को,\n" +
                "दिल चाहता है ये वक्त, ये जिंदगी यही रूक जाये।"));
        list.add(new shayariData("मुझसे दिल की मायूसी यूँ छुपाई नहीं जाती है,\n" +
                "गले लगाती हो तो दिल की धड़कने हँसने लगती हैं।\n" +
                "\n" +
                "नाराजगियां भी कबूल थी आपकी मगर,\n" +
                "एक बार गले से हमें लगाया तो होता।"));
        list.add(new shayariData("लाखों पल गुजारने हिया यूँ ही मुझको,\n" +
                "तेरी बाँहों में रह कर कभी मेरा दिल नहीं भरता।\n" +
                "\n" +
                "सूरत तो दिखाते हैं गले से नहीं मिलते,\n" +
                "आँखों की तो सुन लेते हैं दिल की नहीं सुनते।"));
        list.add(new shayariData("बाहों के दरमियाँ अब दूरी न रहे,\n" +
                "सीने से लगा लो कोई चाहत अधूरी न रहे।"));
        list.add(new shayariData("देख के तेरा हसीं चेहरा\n" +
                "ख़ुशी से फूल जाती हूँ\n" +
                "आके बाहों में तुम्हारी\n" +
                "सारा दर्द भूल जाती हूँ।\n" +
                "हैप्पी हग डे जान"));
        list.add(new shayariData("बातों बातों में दिल ले जाते हो,\n" +
                "देखते हो इस तरह जान ले जाते हो,\n" +
                "अदाओं से अपनी इस दिल को धड़काते हो,\n" +
                "लेकर बाहो में सारा जहां भूलाते हों।"));
        list.add(new shayariData("पानी की बूंदे फूलों को भिगा रही हैं,\n" +
                "ठंडी लहरे एक ताज़गी जगा रही हैं,\n" +
                "हो जायें आप भी इनमें शामिल,\n" +
                "एक प्यारी सी सुबह आपको जगा रही है।"));


    }

    private void initList7() {

        list.add(new shayariData("ज़िन्दगी में कितनी भी टेंशन आए तुम्हारा चेहरा देख लू सारी टेंशन गायब हो जाती है। ❤️️"));
        list.add(new shayariData("लव का मतलब किस\uD83D\uDC8Bकरना नहीं एक दूसरे को समझना है।"));
        list.add(new shayariData("ज़िन्दगी भर केवल चाहा तुम्हे वेलेंटाइन डे पे करूंगा इजहार बस यही है रब से दुआ वो ना करे इंकार।"));
        list.add(new shayariData("दिन चाहे जैसी भी गुज़रे रात को तुम्हे देखते ही सारी तकलीफ़ दूर हो जाती है।"));

        list.add(new shayariData("जितुम सब जानती हो फिर भी अनजान बनती ही लव वेलेंटाइन डे पे आज मै ही बोल दूंगा  (I love You)"));
        list.add(new shayariData("सच्चा प्यार से तो पत्थर भी पिघल जाता है लेकिन ये प्यार नसीब वालो को मिलती है। ❤️️"));
        list.add(new shayariData("हम आपके है कौन आज के मेसेज में बता देना #लव"));

        list.add(new shayariData("वो याद नहीं आती अब … मसरुफ़ रहता हूँ खुद की दौलत में …"));
        list.add(new shayariData("नशा था मेरा वो … छोड़ दिया मैंने अब …"));
        list.add(new shayariData("हसता तो रोज हूँ पर खुश हुए जमाना हो गया"));
        list.add(new shayariData("Kho गये वो रिश्ते जिन्हें हद से ज़्यादा संभाल कर रखा"));
        list.add(new shayariData("ताजमहल हमारे लिए बकवास है, क्यूंकि रोज़ बदलती हमारी मुमताज़ हैं."));
    }

    private void initList8() {
        list.add(new shayariData("म2-तू चांद पूनम सा बन,\n" +
                "मैं सर्द सी रात बन साथ दूंगी"));
        list.add(new shayariData("जीने के लिए नहीं चाहा है तुम्हें,\n" +
                "तुम्हें चाहने के लिए जीते अब हम।"));
        list.add(new shayariData("फ़क़त तुम दूर हो हमसे,\n" +
                "पर ईद का चांद तुम्हारी याद दिलाता है।।"));
        list.add(new shayariData("मौत ने आँखें मिलाई थी कई बार मुझसे\n" +
                "पर तेरा दीवाना किसी और पे मरता कैसे!!"));

        list.add(new shayariData("जिसको याद करने से होठों पे मुस्कराहट आ जाये…\n" +
                "ऐसा एक खूबसूरत ख़याल हो तुम…"));
        list.add(new shayariData("दर्द तो सभी को होता है,\n" +
                "बस हमदर्द नसीब वालों को मिलते हैं। ❤️️"));
        list.add(new shayariData("तड़प रहे हैं हम तेरे एक अल्फाज के लिए\n" +
                "अपनी खामोशी तोड़ दे हमे जिंदा रखने के लिए"));
        list.add(new shayariData("तेरे न होने से भी मेरी गलियां भरी भरी सी लगती है,\n" +
                "हां, तेरी इस मोहब्बत को क्या नाम दूं।।"));
        list.add(new shayariData("तू अच्छा मनका तो बन,\n" +
                "मैं डोर बन तेरा साथ दूंगी।।"));
        list.add(new shayariData("इस तरह दस्तक़ को,\n" +
                "तुम्हारा इश्क़ कहे या प्यार?"));
        list.add(new shayariData("तू चांद पूनम सा बन,\n" +
                "मैं सर्द सी रात बन साथ दूंगी.."));
        list.add(new shayariData("प्यार में गम नहीं\n" +
                "बस एक हमसफ़र मिलता है...."));
        list.add(new shayariData("मेरी शायरी की छांव में आकर बैठ जाया करते हैं,\n" +
                "वह आशिक जो मोहब्बत की धूप में जले होते हैं|"));
        list.add(new shayariData("Akele To Hum Pehle Bhi Jee Rahe The\n" +
                "Kyu Tanha Se Ho Gaye Hai Tere Jane Ke Baad"));
        list.add(new shayariData("Sub Roshnian muj say Roth gain Yeh kah kar.!\n" +
                "Tum Apney Ciragon ki Hifazut nahi Kartey.!"));
        list.add(new shayariData("Tamam Umar Mujhe Tootna Bhikarna Tha….\n" +
                "Wo Meherbaan Bhi Kahan Tak Samet Tha Mujhe…."));
        list.add(new shayariData("Main jo mehka to meri shaakh jala di us ne\n" +
                "Sabz mosam main mujhey zard hawa Di us ne"));
        list.add(new shayariData("Tumhari dunia me hm jese hazaaron hen\n" +
                "Hum hi pagal the jo tumhay paa k itraanay lagay"));
        list.add(new shayariData("dagh daman k ho’n, dil k ho’n k chehre k\n" +
                "kuch nisha’n umr ki raftar se lag jate hain"));
    }


}